app/Controllers/AuthAPIController.php

    public function login_action()
    {
        $session = session();
        $userModel = new User();
        $username = $this->request->getVar('username');
        $password = md5($this->request->getVar('password'));

        $data = $userModel->where('username', $username)->first();
---
SELECT *
FROM `user`
WHERE `username` = 'Enji'
 LIMIT 1