app/Models/Rating.php

INSERT INTO `rating` (`rating`, `wahanaId`) VALUES (5, 4)
---
    public function createRating(int $rating, int $wahanaId) {
        return $this->insert([
            'rating' => $rating,
            'wahanaId' => $wahanaId,

        ]);

SELECT `rating`.`wahanaId`, `nama`, AVG(`rating`) AS `rating`
FROM `rating`
JOIN `wahana` ON `wahana`.`wahanaId` = `rating`.`wahanaId`
WHERE `rating`.`wahanaId` = 1
GROUP BY `wahana`.`wahanaId`
---
    public function calculateWahanaRating() {
        return $this->select('rating.wahanaId, nama')->selectAvg('rating')->join('wahana', 'wahana.wahanaId = rating.wahanaId')->groupBy('wahana.wahanaId')->orderBy('rating')->findAll(5);