app/Models/Wahana.php

SELECT *
FROM `wahana`
---
    public function getAllWahana() {
        return $this->findAll();

SELECT *
FROM `wahana`
WHERE `wahana`.`id` = 5
---
    public function getWahanaById(int $wahanaId) {
        return $this->find($wahanaId);